<?php

// +加  -减  *乘  /除
//
// 问题: 除法中,第二个数,也就是除数,不能为0,否则程序会报错

// echo 5 / 2;

// 除数为0,系统会报错,输出结果为INF
// echo 5 / 0;

// % 求余数运算/求模运算
//
// 5除以2,商2余1
//
// 问题
// 1,整除的结果为0
//
// 2,求余数运算,执行的结果,正负与第一个数值也就是被除数相同
//
// 3,PHP程序中,求余数运算,只接受整数,不要使用浮点数参与求余数运算
//
// 4,第二个数值,也就是除数,不能为0

echo 5 % 2, '<hr>';
echo 4 % 2, '<hr>';
echo -5 % -2, '<hr>';
echo 5 % -2, '<hr>';
echo 5.5 % 2, '<hr>';
echo 5 % 2.5, '<hr>';

// ** 乘方运算 pow()函数,作用相同
//
// ** 运算符的执行效率略高于函数的执行效率
//
//

// 2的5次方
echo 2 ** 5, '<hr>';
echo pow(2, 5), '<hr>';

echo 2.5 ** 5, '<hr>';
echo 2.5 ** 5.5, '<hr>';
echo 2.5 ** '5.5aaa', '<hr>';
