<?php

// if的嵌套
//
// 随机生成1-100的数值
//
// 判断 如果是奇数,判断其范围是否在 50-60之间
//
//      如果是偶数,判断其范围是否在 20-30之间

$int = mt_rand(1, 100);

// $int%2 != 0表达式结果为true为奇数
if ($int % 2 != 0) {
    if ($int >= 50 && $int <= 60) {
        echo "{$int}是奇数,在50-60范围之内";
    } else {
        echo "{$int}是奇数,不在50-60范围之内";
    }

// 偶数情况
} else {
    if ($int >= 20 && $int <= 30) {
        echo "{$int}是偶数,在20-30范围之内";
    } else {
        echo "{$int}是偶数,不在20-30范围之内";
    }

}

// 总结
//
// if语句允许嵌套关系的存在
//
// 三元运算符,不要写多层的嵌套
//
// 如果有嵌套一定要写成if形式
